# -*- coding: utf-8 -*-
# 购物价游戏 - GuessPrice项目模板
# 通过按钮和文本框实现输入
# 所有和游戏相关的输出都显示在控制台上
'''
请在此处完善你个人的信息
学院：
班级：
学号：
姓名：
'''
import re
import os

# 初始化全局变量

def foo():
    return None
    
class Bar:
    pass

# 自定义函数，用于游戏和新一轮游戏的启动
def new_game():
    # 请在此处填写代码    
    pass

# 为控制面板定义事件处理程序
def range10():
    #改变竞价范围[0,10)和重新启动游戏的按钮
    #请在此处填写代码
    pass
def range100():
    #改变竞价范围[0,100)和重新启动游戏的按钮
    #请在此处填写代码
    pass
def range1000():
    #改变竞价范围[0,1000)和重新启动游戏的按钮
    #请在此处填写代码
    pass
def input_guess(guess):
    #游戏主要的逻辑设计在这一部分
    #请在此处填写代码
    pass
    
# 创建框架

# 为框架添加对象及处理事件




# 调用new_game并且启动框架运行


# 时刻记得根据得分标准检查你完成的程序

